career_development.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-26 Mon 16:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Career Development part of Methods: Python Programming for Economists</title>
<meta name="author" content="Joyce Ladenstein, Career Services Officer Master Economics" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Career Development part of Methods: Python Programming for Economists</h1>
<p>
<b><b>This page is under construction for 2024/2025</b></b> 
</p>

<ul class="org-ul">
<li>J.Y.M.Ladenstein [at] tilburguniversity.edu</li>
<li>Office hours: Upon appointment</li>
<li>Canvas page with more information: Career Development Economics:
<ul class="org-ul">
<li><a href="https://tilburguniversity.instructure.com/courses/13424">https://tilburguniversity.instructure.com/courses/13424</a></li>
</ul></li>
</ul>

<div id="outline-container-org7891c0d" class="outline-2">
<h2 id="org7891c0d">Goal</h2>
<div class="outline-text-2" id="text-org7891c0d">
<p>
The goal of the career development part of the course Methods: Python Programming for Economists is to help students from the Master Economics transition into their careers after graduation. The focus of the course is on personal growth and development and provides practical tools to be well prepared for the job application process. 
</p>
</div>
</div>

<div id="outline-container-org2d8d0b1" class="outline-2">
<h2 id="org2d8d0b1">Description</h2>
<div class="outline-text-2" id="text-org2d8d0b1">
<p>
In both semester 1 and semester 2, workshop(s) will be offered by Student Career Services. Participation in the workshop 'Finding purpose: Discover a fulfilling and impactful future' in semester 1 (consisting of 2 sessions) is optional (according to own needs). Participation in at least 1 workshop of your choice in semester 2 is mandatory. In addition, participation in at least 1 career event of your choice organized by Asset-Economics during the year is mandatory. 
</p>
</div>
</div>

<div id="outline-container-orgda6d45a" class="outline-2">
<h2 id="orgda6d45a">Kick-off session</h2>
<div class="outline-text-2" id="text-orgda6d45a">
<p>
kick-off sessions of the course are planned at the beginning of each semester to give new students more information about the career development part of the course Methods: Python Programming for Economists. 
</p>
</div>
</div>


<div id="outline-container-orga543dff" class="outline-2">
<h2 id="orga543dff">Workshops</h2>
<div class="outline-text-2" id="text-orga543dff">
</div>
<div id="outline-container-org3f3ff00" class="outline-3">
<h3 id="org3f3ff00">Semester 1 (blok 2):</h3>
<div class="outline-text-3" id="text-org3f3ff00">
<p>
Students can choose (according to own needs) to follow the workshop: 'Finding purpose: Discover a fulfilling and impactful future' spread over 2 sessions (participation in both is required) organized by Student Career Services. 
</p>

<ul class="org-ul">
<li>The 1st session lasts 2.5 hours as we kick off the session by an interactive session with 2 economists/ alumni sharing their purpose story for inspiration.</li>
<li>The 2nd session lasts 2 hours and takes place approximately 3 weeks after the 1st session.</li>
<li>3 weeks prior to the 1st session students must have registered via Canvas so we know how many groups there are and how many trainers are needed.</li>
</ul>
</div>

<div id="outline-container-org2d3008e" class="outline-4">
<h4 id="org2d3008e">Assignments:</h4>
<div class="outline-text-4" id="text-org2d3008e">
<ul class="org-ul">
<li>In preparation for the workshop, students fill out the VIA Character Strengths Survey and complete a small preparatory assignment. They take the outcome to the 1st session of the workshop.</li>
<li>After the first session, participants are given an interim assignment. They take the outcome to the 2nd session of the workshop.</li>
<li>If students need it, they can take advantage of the opportunity to receive 1 hour of 1-on-1 coaching from an experienced career coach from Student Career Services in addition to the workshop.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgece54a9" class="outline-3">
<h3 id="orgece54a9">Semester 2 (blok 4):</h3>
<div class="outline-text-3" id="text-orgece54a9">
<p>
Students choose at least one of the following practical workshops organized by Student Career Services (mandatory): 
</p>
<ul class="org-ul">
<li>Unlock Success: Master your assessment with expert preparation!</li>
<li>Empower your potential: Elevate your personal effectiveness today!</li>
<li>PitchPower: Mastering the art of real-life branding</li>
<li>CareerReady: Ace your job interview</li>
<li>Connecting futures: How to use LinkedIn</li>
</ul>

<p>
3 weeks prior to the workshops students must have registered via Canvas so we know how many groups there are and how many trainers are needed. 
</p>
</div>

<div id="outline-container-org38901ee" class="outline-4">
<h4 id="org38901ee">Preparation assignments</h4>
<div class="outline-text-4" id="text-org38901ee">
<ul class="org-ul">
<li>In preparation of the workshop ‘PitchPower: Mastering the art of real-life branding’, students complete the Career Academy's online Canvas module "elevator pitch’’. The outcome is not immediately reviewed by Student Career Services afterwards. Students take the outcome to the workshop and continue working with it during the workshop (deepening).</li>
<li>In preparation of the workshop ‘Connecting futures: How to use LinkedIn', students complete the Career Academy's online Canvas module "LinkedIn’’. The outcome is not immediately reviewed by Student Career Services afterwards. Students take the outcome to the workshop and continue working with it during the workshop (deepening).</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org3a916d2" class="outline-2">
<h2 id="org3a916d2">Career Events</h2>
<div class="outline-text-2" id="text-org3a916d2">
<p>
Students participate in at least one of the following career events organized by Asset-Economics (mandatory) during the year: 
</p>
<ul class="org-ul">
<li>Inside the Business Day</li>
<li>Economist in a world of data</li>
<li>Economics Dinner</li>
<li>Talent Day</li>
<li>Business Data Challenge</li>
</ul>

<p>
Registration via the website of Asset-Economics. 
</p>
</div>
</div>

<div id="outline-container-orge7ad214" class="outline-2">
<h2 id="orge7ad214">Grading</h2>
<div class="outline-text-2" id="text-orge7ad214">
<p>
The workshops and career events are part of the course ‘Methods: Python Programming for Economists’. To pass the course, you must participate in at least 1 workshop of your choice in semester 2 and 1 career event in semester 1 or 2. You will receive a partial grade once you have completed the Python programming part of the course. At the end of the academic year, you will be assessed whether you have met the set criteria of the career development part of the course through a pass or fail. Only with a positive grade for the Python programming part of the course and a pass for the career development part of the course you have passed the course ‘Methods: Python Programming for Economists’.
</p>
</div>

<div id="outline-container-org395a45e" class="outline-3">
<h3 id="org395a45e">Resit</h3>
<div class="outline-text-3" id="text-org395a45e">
<p>
If there are special circumstances that prevent you from attending 1 of the mandatory workshops in semester 2 or 1 Asset-Economics career event throughout the year, please contact TiSEM Career Services, tisem.careerservices@uvt.nl, for an alternative assignment. 
</p>
</div>
</div>
</div>



<div id="outline-container-orgc1d2306" class="outline-2">
<h2 id="orgc1d2306">Appendix 1 Content of the workshops</h2>
<div class="outline-text-2" id="text-orgc1d2306">
</div>
<div id="outline-container-org9a21e5d" class="outline-3">
<h3 id="org9a21e5d">Finding purpose: Discover a fulfilling and impactful future (2 sessions, 1 of 2,5 hour and 1 of 2 hours)</h3>
<div class="outline-text-3" id="text-org9a21e5d">
<p>
Unlock the key as a start to a more purpose-driven life! Join this interactive workshop, where you'll embark on a journey of self-discovery, and chart your course toward a fulfilling and purposeful future. 
</p>
</div>
</div>



<div id="outline-container-orgd4c8c16" class="outline-3">
<h3 id="orgd4c8c16">Unlock Success: Master Your Assessment with Expert Preparation!</h3>
<div class="outline-text-3" id="text-orgd4c8c16">
<p>
In addition to the experience of completing a valid personality questionnaire and achieving the results, you will learn:
</p>
<ul class="org-ul">
<li>What exactly an assessment is, how do you prepare, and what types of assessments exist?</li>
<li>Which competencies are considered essential by the employer How to remove a review day can be seen?</li>
<li>What different capacity tests, practical simulations, models, and instruments are available (reinventing assessments)?</li>
<li>What the Big Five means in relation to the personality questionnaire. Through the Big Five personality test, organizations want to gain insight into the character and personality of the applicant?</li>
<li>Achieve your test results and how you can move forward with them.</li>
<li>How to Prepare for The Interview &amp; Expanding the STARR Method.</li>
</ul>
</div>
</div>


<div id="outline-container-orgdb3522d" class="outline-3">
<h3 id="orgdb3522d">Empower your potential: Elevate your personal effectiveness today!</h3>
<div class="outline-text-3" id="text-orgdb3522d">
<p>
This workshop is aimed at developing skills and behavior that lead to personal success and effectiveness. Themes such as taking responsibility, increasing the influence of your actions on your own life and that of others, proactivity and goal setting are some of the components we will delve into in more detail. In short, you learn how to get behind the wheel of your own life (again).  
</p>
</div>
</div>



<div id="outline-container-orgea96350" class="outline-3">
<h3 id="orgea96350">PitchPower: Mastering the art of real-life branding</h3>
<div class="outline-text-3" id="text-orgea96350">
<p>
What makes you unique and how do you present your unique ‘I-brand’. How are you going to use this in your search for a job? At the end of this workshop, you have defined your personal brand, and you know how to show it while networking on- and offline in search for a job. 
</p>
</div>
</div>


<div id="outline-container-org7795229" class="outline-3">
<h3 id="org7795229">CareerReady: Ace your job interview</h3>
<div class="outline-text-3" id="text-org7795229">
<p>
After this workshop, you know what is expected from you during a job interview and you can present yourself well. 
</p>
</div>
</div>

<div id="outline-container-org1bda3e9" class="outline-3">
<h3 id="org1bda3e9">Connecting futures: How to use LinkedIn</h3>
<div class="outline-text-3" id="text-org1bda3e9">
<p>
This workshop will provide you with tips on how you can use LinkedIn to find a job, connect with interesting people and companies. 
</p>
</div>
</div>
</div>



<div id="outline-container-org0ef8a2a" class="outline-2">
<h2 id="org0ef8a2a">Appendix 1 Content of the Career Events</h2>
<div class="outline-text-2" id="text-org0ef8a2a">
<ul class="org-ul">
<li>Inside the Business Day</li>
<li>Economist in a world of data</li>
<li>Economics Diner</li>
<li>Talent Day</li>
<li>Business Data Challenge</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joyce Ladenstein, Career Services Officer Master Economics</p>
<p class="date">Created: 2024-08-26 Mon 16:56</p>
</div>
</body>
</html>
